app/controllers/challenges_controller.rb

  def new
    @challenge = Challenge.new
    @questionaire ||= Questionaire.first
---
SELECT "questionaires".* FROM "questionaires" LIMIT 1

  def create
    @questionaire = Questionaire.where("id > (?)",params["challenge"]["questionaire_id"]).first
    Challenge.new(params[:challenge]).save
    Challenge.count > 10 ? render(:display_result) : redirect_to(new_challenge_path)
---
SELECT "questionaires".* FROM "questionaires" WHERE (id > ('1')) LIMIT 1
INSERT INTO "challenges" ("created_at", "input", "output", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 13 May 2012 11:11:45 UTC +00:00], ["input", "a = 'hello'  b= 'world'"], ["output", "'helloworld'"], ["updated_at", Sun, 13 May 2012 11:11:45 UTC +00:00]]
SELECT "challenges".* FROM "challenges"