app/controllers/challenges_controller.rb

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @challenge = Challenge.find(params[:id])